[

{"text": "Chip maker takes over its Israeli-based driverless technology partner Mobileye in an all-cash deal. U.S. chip giant Intel has agreed to buy Israeli technology firm Mobileye for $63.54 per share in cash.", "label": "Business"},

{"text": "Unicef says more children were killed in 2016 than in any other year during the civil war. Syrian children suffered the most war-related violations in 2016 as the civil war waged on, a UNICEF report showed.", "label": "Current Affairs"},

{"text": "The ruling comes from the same judge who blocked Donald Trumps first attempt at a ban. Judge bars enforcement of the policy to deny U.S. entry to the wife and child of a Syrian refugee.", "label": "Politics"},

{"text": "Granit Xhaka suffered a kick to the calf last weekend and has only a \"little chance\" of playing, according to Arsenal manager Arsene Wenger.\r\n\r\nShkodran Mustafi and David Ospina are back in training after respective thigh and back problems.\r\n\r\nManchester United are without Ashley Young, who was forced off with a muscle injury against Celta Vigo.\r\n\r\nMarouane Fellaini is banned and Luke Shaw, Timothy Fosu-Mensah, Marcos Rojo and Zlatan Ibrahimovic are all injured.\r\n\r\nUnited may rest key players like Marcus Rashford, who began Thursday's game in Spain despite carrying an injury and appeared to be in pain when he was substituted.", "label": "Sport"},

{"text": "Nasa runs competition to help make old Fortran code faster\r\n\r\nNasa is seeking help from coders to speed up the software it uses to design experimental aircraft.\r\nIt is running a competition that will share $55,000 (£42,000) between the top two people who can make its FUN3D software run up to 10,000 times faster.\r\nThe FUN3D code is used to model how air flows around simulated aircraft in a supercomputer.\r\nThe software was developed in the 1980s and is written in an older computer programming language called Fortran.\r\n\"This is the ultimate 'geek' dream assignment,\" said Doug Rohn, head of Nasa's transformative aeronautics concepts program that makes heavy use of the FUN3D code.\r\nIn a statement, Mr Rohn said the software is used on the agency's Pleiades supercomputer to test early designs of futuristic aircraft.\r\nThe software suite tests them using computational fluid dynamics, which make heavy use of complicated mathematical formulae and data structures to see how well the designs work.\r\nBottlenecks\r\nOnce designs are proved on the supercomputer, scale models are tested in wind tunnels and then finally experimental craft undergo real world testing.\r\nSignificant improvements could be gained just by simplifying a heavily used sub-routine so it runs a few milliseconds faster, said Nasa on the webpage describing the competition. If the routine is called millions of times during a simulation this could \"significantly\" trim testing times, it added.\r\nNasa said it would provide copies of the code to anyone taking part so they can analyse it, find bottlenecks and suggest modifications that could speed it up. Nasa is looking for the code to run at least 10 times faster but would like it quickened by thousands of times, if possible.\r\nAny changes to FUN3D must not make it less accurate, said Nasa.\r\nThe sensitive nature of the code means the competition is only open to US citizens who are over 18.", "label": "Science"}

]
